incompressible/pimpleFoam/laminar/planarPoiseuille/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication $(getApplication)

wmake validation/WatersKing
runApplication WatersKing

( cd validation && ./createGraph )

#------------------------------------------------------------------------------
